{
    "gameModel": {
        "initialSceneDescriptions": {
            "cave": {
                "en": [
                    "You wake up tied to a chair in a dimly lit cellar. Your wrists are bound by a rusty chain locked to the chare. ",
                    "A guard is sleeping nearby with a keychain visibily handing from his belt. ",
                    "You notice a loose board on the floor. the air is damp and you can hear water dripping somewhere."
                ],
                "fr": [
                    "Vous vous réveillez attaché à une chaise dans une cave faiblement éclairée. Vos poignets sont liés par une chaîne rouillée attachée à la chaise. ",
                    "Un garde dort à proximité, un porte-clés accroché à sa ceinture. ",
                    "Vous remarquez une planche détachée sur le sol. L'air est humide et vous pouvez entendre de l'eau couler quelque part."
                ]
            },
            "office": {
                "en": [
                    "You've entered the Capo's office. It's an elegant room with dark wood furniture. ",
                    "A large desk dominates the center, and on the wall behind it is a painting that looks slightly askew. ",
                    "A safe is embedded in the wall, hidden behind the painting. ",
                    "On the desk, you see various papers, a pen holder, and a small UV lamp."
                ],
                "fr": [
                    "Vous êtes entré dans le bureau du Capo. C'est une pièce élégante avec des meubles en bois sombre. ",
                    "Un grand bureau domine le centre, et sur le mur derrière lui se trouve un tableau qui semble légèrement de travers. ",
                    "Un coffre-fort est encastré dans le mur, caché derrière le tableau. ",
                    "Sur le bureau, vous voyez divers papiers, un porte-stylo et une petite lampe UV."
                ]
            },
            "exfiltration": {
                "en": [
                    "You've made it to the back alley. The night air is cool as you hear distant sounds of the city. ",
                    "You see a broken phone in a trash can nearby. This could be your chance to contact the authorities. ",
                    "You can hear voices coming from inside the building. The clock is ticking."
                ],
                "fr": [
                    "Vous êtes arrivé dans la ruelle. L'air nocturne est frais et vous entendez les bruits lointains de la ville. ",
                    "Vous voyez un téléphone cassé dans une poubelle à proximité. C'est peut-être l'occasion de contacter les autorités. ",
                    "On entend des voix à l'intérieur du bâtiment. L'heure tourne."
                ]
            }
        },
        "caveActions": {
            "en": [
                "Examine the chain",
                "Look under the loose board",
                "Check the sleeping guard",
                "Unlock the door and leave"
            ],
            "fr": [
                "Examiner la chaîne",
                "Regardez sous la planche lâche",
                "Vérifiez le garde endormi",
                "Déverrouillez la porte et partez"
            ]
        },
        "isOutOfTime": {
            "en": "You hear footsteps approaching. The door swings open, and several armed men enter. You've run out of time.",
            "fr": "Vous entendez des pas approcher. La porte s'ouvre brusquement et plusieurs hommes armés entrent. Vous n'avez plus de temps."
        },
        "inventory": {
            "en": [
                "File",
                "Keys",
                "Pen",
                "UV Lamp",
                "Evidence",
                "Battery"
            ],
            "fr": [
                "Lime",
                "Clés",
                "Stylo",
                "Lampe UV",
                "Preuve",
                "Batterie"
            ]
        },
        "caveActionResponseDescription": {
            "en": [
                [
                    "You carefully lift the loose board, trying not to make any noise. ",
                    "Underneath, you find a rusty metal file. This could be useful."

                ],
                "You've already taken everything useful from under the board.",
                "The guard wakes up suddenly! He sees you and raises the alarm. Game over.",
                [
                    "The guard is sleeping soundly. His keychain is hanging from his belt. ",
                    "You can't reach it from here while you're still chained."
                ],
                "You weren't quiet enough. The guard wakes up, spots you, and raises the alarm. Game over.",
                [
                    "You slowly approach the sleeping guard. Carefully, you take a wooden plank from nearby ",
                    "and knock him unconscious with a swift strike. You grab his keychain."
                ]
            ],
            "fr": [
                [
                    "Vous soulevez soigneusement la planche détachée, en essayant de ne pas faire de bruit. ",
                    "En dessous, vous trouverez une lime en métal rouillée. Cela pourrait être utile."
                ],
                "Vous avez déjà pris tout ce qui était utile sous le plateau.",
                "Le garde se réveille en sursaut! Il vous voit et donne l'alerte. Fin de partie.",
                [
                    "Le garde dort profondément. Son porte-clés est accroché à sa ceinture. ",
                    "Tu ne peux pas l'atteindre d'ici tant que tu es encore enchaîné."
                ],
                "Tu n'as pas été assez silencieux. Le garde se réveille, te repère et donne l'alerte. Fin de partie.",
                [
                    "Vous vous approchez lentement du garde endormi. Avec précaution, vous prenez une planche de bois à proximité. ",
                    "et le frappe violemment pour l'assommer. Tu lui prends son porte-clés."
                ]
            ]
        },
        "officeActions": {
            "en": [
                "Examine the desk",
                "Look at the painting",
                "Check the UV lamp",
                "Enter safe code",
                "Use UV lamp on note",
                "Leave the office"
            ],
            "fr": [
                "Examinez le bureau",
                "Regardez le tableau",
                "Vérifiez la lampe UV",
                "Entrez le code de sécurité",
                "Utiliser une lampe UV sur note",
                "Quitter le bureau"
            ]
        },
        "officeActionResponseDescription": {
            "en": [
                [
                    "You search through the items on the desk. Among the papers, you find a pen with faded colors. ",
                    "There's something unusual about it. You pocket the pen."
                ],
                "You've already taken the pen from the desk. The remaining papers don't contain any useful information.",
                [
                    "You move the painting aside to reveal a wall safe with a 4-digit keypad. ",
                    "You need the correct code to open it."
                ],
                "You examine the small UV lamp on the desk. It seems to be working. You pocket it thinking it might be useful.",
                "You've already taken the UV lamp.",
                [
                    "You shine the UV lamp on a seeming blank note on the desk. Hidden numbers become visible: 1, 5, 9, 3. ",
                    "But in what order should they be entered?"
                ],
                [
                    " Looking at the pen more carefully, you notice it has four color bands: yellow, green, red, blue. ",
                    "This might indicate the order of the digits."
                ],
                [
                    "You think about the numbers and try to determine the correct order. ",
                    "The pen's colors might be a clue: yellow, green, red, blue. ",
                    "Matching them to the numbers: 9, 3, 5, 1. You enter 9351..."
                ],
                [
                    " The safe clicks open! Inside, you find a folder labeled 'Operations' containing detailed ",
                    "records of the mafia's illegal activities. This is exactly the evidence you need."
                ],
                "You've already opened the safe and taken the evidence.",
                [
                    "With the evidence secured, you carefully exit the office and head toward the back alley ",
                    "to find a way to contact the authorities."
                ]
            ],
            "fr": [
                [
                    "Vous fouillez les objets sur le bureau. Parmi les papiers, vous trouvez un stylo aux couleurs délavées. ",
                    "Il y a quelque chose d'inhabituel. On met le stylo dans sa poche."
                ],
                "Vous avez déjà pris le stylo sur le bureau. Les papiers restants ne contiennent aucune information utile.",
                [
                    "Vous déplacez le tableau sur le côté pour révéler un coffre-fort mural avec un clavier à 4 chiffres. ",
                    "Vous avez besoin du bon code pour l'ouvrir."
                ],
                "Vous examinez la petite lampe UV sur le bureau. Elle semble fonctionner. Vous la rangez dans votre poche, pensant qu'elle pourrait vous être utile.",
                "Vous avez déjà pris la lampe UV.",
                [
                    "Vous éclairez une note apparemment vierge sur le bureau avec la lampe UV. Des chiffres cachés apparaissent: 1, 5, 9, 3. ",
                    "Mais dans quel ordre faut-il les saisir?"
                ],
                [
                    " En regardant le stylo plus attentivement, vous remarquez qu'il comporte quatre bandes de couleur : jaune, vert, rouge, bleu. ",
                    "Cela pourrait indiquer l'ordre des chiffres."
                ],
                [
                    "Vous pensez aux nombres et essayez de déterminer l’ordre correct. ",
                    "Les couleurs du stylo pourraient être un indice : jaune, vert, rouge, bleu. ",
                    "En les associant aux nombres : 9, 3, 5, 1. Vous entrez 9351..."
                ],
                [
                    " Le coffre-fort s'ouvre avec un clic! À l'intérieur, vous trouverez un dossier intitulé 'Opérations' contenant des informations détaillées ",
                    "des documents attestant des activités illégales de la mafia. C'est exactement la preuve dont vous avez besoin."
                ],
                "Vous avez déjà ouvert le coffre-fort et pris les preuves.",
                [
                    "Une fois les preuves récupérées, vous sortez prudemment du bureau et vous dirigez vers la ruelle arrière ",
                    "pour trouver un moyen de contacter les autorités."
                ]
            ]
        },
        "exfiltrationActions": {
            "en": [
                "Examine the broken phone",
                "Search the trash can",
                "Listen for approaching people",
                "Fix the phone",
                "Enter phone PIN",
                "Send evidence to police"
            ],
            "fr": [
                "Examinez le téléphone cassé",
                "Fouillez la poubelle",
                "Soyez à l'écoute des personnes qui s'approchent",
                "Réparer le téléphone",
                "Entrez le code PIN du téléphone",
                "Envoyer des preuves à la police"
            ]
        },
        "exfiltrationActionResponseDescription": {
            "en": [
                [
                    "The phone's screen is cracked, but it might still work. However, the battery is missing. ",
                    "You'll need to find a compatible battery."
                ],
                "You dig through the trash and find a cell phone battery. It looks like it might fit the broken phone.",
                "You've already searched the trash thoroughly. There's nothing else usefull here.",
                "You hear footsteps and voices getting closer. Before you can react, several armed men surround you. Game over.",
                [
                    "You listen carefully. You can hear people moving inside the building, but they don't seem to be coming your way yet. ",
                    "You need to hurry though; it's only a matter of time before they discover you're missing."
                ],
                "You insert the battery into the phone. The screen lights up! The phone is working, but it needs a PIN code to unlock.",
                [
                    "You need to guess the PIN. Looking at the evidence documents, you notice a recurring 4-digit number: 1984. ",
                    "You try it as the PIN... It works! The phone unlocks."
                ],
                [
                    "You dial the emergency number and connect with the police. You quickly explain who you are and your situation. ",
                    "You take photos of the evidence documents and send them through a secure channel. ",
                    "The operator confirms receipt and tells you to find a safe hiding spot while they dispatch units to your location. ",
                    "Minutes later, you hear sirens approaching. You've done it! The mafia will be brought to justice thanks to your bravery."
                ],
                "battery is missing"
            ],
            "fr": [
                [
                    "L'écran du téléphone est fissuré, mais il pourrait encore fonctionner. Cependant, la batterie est manquante. ",
                    "Vous devrez trouver une batterie compatible."
                ],
                "Vous fouillez dans les poubelles et trouvez une batterie de téléphone portable. Elle semble convenir au téléphone cassé.",
                "Vous avez déjà fouillé la corbeille à fond. Il n'y a rien d'autre d'utile ici.",
                "Vous entendez des pas et des voix se rapprocher. Avant que vous puissiez réagir, plusieurs hommes armés vous encerclent. Fin de partie.",
                [
                    "Vous écoutez attentivement. Vous entendez des gens bouger à l'intérieur du bâtiment, mais ils ne semblent pas encore venir vers vous. ",
                    "Mais vous devez vous dépêcher, ce n'est qu'une question de temps avant qu'ils ne découvrent que vous avez disparu."
                ],
                "Vous insérez la batterie dans le téléphone. L'écran s'allume! Le téléphone fonctionne, mais il faut un code PIN pour le déverrouiller.",
                [
                    "Vous devez deviner le code PIN. En examinant les documents de preuve, vous remarquez un nombre récurrent à quatre chiffres: 1984. ",
                    "Vous l'essayez comme code PIN... Ça marche! Le téléphone se déverrouille."
                ],
                [
                    "Vous composez le numéro d'urgence et contactez la police. Vous expliquez rapidement qui vous êtes et votre situation. ",
                    "Vous prenez des photos des documents de preuve et les envoyez via un canal sécurisé. ",
                    "L'opérateur confirme la réception et vous demande de trouver une cachette sûre pendant qu'ils envoient des unités à votre emplacement. ",
                    "Quelques minutes plus tard, vous entendez les sirènes approcher. Vous avez réussi ! La mafia sera traduite en justice grâce à votre courage."
                ],
                "la batterie est manquante"
            ]
        },
        "inventoryStringFormater": {
            "en": [
                "Inventory: Empty",
                "Inventory: "
            ],
            "fr": [
                "Inventaire: vide",
                "Inventaire: "
            ]
        }
    },
    "gameView": {}
}